intermediaries/subscription-notification-service-intermediary/src/test/resources/xmlInstances/fbiSubscribeSoapRequest.xml

<!--

    Unless explicitly acquired and licensed from Licensor under another license, the contents of
    this file are subject to the Reciprocal Public License ("RPL") Version 1.5, or subsequent
    versions as allowed by the RPL, and You may not copy or use this file in either source code
    or executable form, except in compliance with the terms and conditions of the RPL

    All software distributed under the RPL is provided strictly on an "AS IS" basis, WITHOUT
    WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, AND LICENSOR HEREBY DISCLAIMS ALL SUCH
    WARRANTIES, INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
    PARTICULAR PURPOSE, QUIET ENJOYMENT, OR NON-INFRINGEMENT. See the RPL for specific language
    governing rights and limitations under the RPL.

    http://opensource.org/licenses/RPL-1.5

    Copyright 2012-2015 Open Justice Broker Consortium

-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <b:Subscribe xmlns:nc="http://niem.gov/niem/niem-core/2.0"
            xmlns:smext="http://ojbc.org/IEPD/Extensions/Subscription/1.0"
            xmlns:sm="http://ojbc.org/IEPD/Exchange/SubscriptionMessage/1.0"
            xmlns:b="http://docs.oasis-open.org/wsn/b-2"
            xmlns:add="http://www.w3.org/2005/08/addressing"
            xmlns:topics="http://ojbc.org/wsn/topics"
            xmlns:jxdm41="http://niem.gov/niem/domains/jxdm/4.1">
            <b:ConsumerReference>
                <add:Address>http://www.ojbc.org/OJB/SubscribeNotify</add:Address>
                <add:ReferenceParameters/>
                <add:Metadata/>
            </b:ConsumerReference>
            <b:Filter>
                <b:TopicExpression
                    Dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete">
                    topics:person/arrest</b:TopicExpression>
            </b:Filter>
            <b:InitialTerminationTime/>
            <b:SubscriptionPolicy/>
            <sm:SubscriptionMessage>
                <smext:Subject>
                    <nc:PersonName>
                        <nc:PersonFullName>Test Person</nc:PersonFullName>
						<nc:PersonGivenName>Test</nc:PersonGivenName>
						<nc:PersonSurName>Person</nc:PersonSurName>                        
                    </nc:PersonName>
                    <jxdm41:PersonAugmentation>                    
						<jxdm41:PersonFBIIdentification>
							<nc:IdentificationID>123456789</nc:IdentificationID>
						</jxdm41:PersonFBIIdentification>                    
                        <jxdm41:PersonStateFingerprintIdentification>
                            <nc:IdentificationID>A9999999</nc:IdentificationID>
                        </jxdm41:PersonStateFingerprintIdentification>
                    </jxdm41:PersonAugmentation>
                </smext:Subject>
                <nc:ContactEmailID>po6@localhost</nc:ContactEmailID>
                <smext:SystemName>{http://demostate.gov/SystemNames/1.0}SystemA</smext:SystemName>
		        <smext:SubscriptionQualifierIdentification>
		            <nc:IdentificationID>1234578</nc:IdentificationID>
		        </smext:SubscriptionQualifierIdentification>     
		        <smext:CriminalSubscriptionReasonCode>CI</smext:CriminalSubscriptionReasonCode>           
            </sm:SubscriptionMessage>
        </b:Subscribe>
    </soapenv:Body>
</soapenv:Envelope>
